{
    "@context": "https://schema.org",
    "@type": "Recipe",
    "name": "Amish Cinnamon Bread",
    "author": {
        "@type": "Person",
        "name": ""
    },
    "description": "also known as 'friendship bread'",
    "recipeCategory": "breads",
    "recipeYield": "yield",
    "recipeIngredient": [
        "2 1/2 Cups milk",
        "3 Cups sugar",
        "4 Cups flour",
        "1 Cup vegetable oil",
        "1/2 Cup milk",
        "3 eggs",
        "1 tsp vanilla",
        "2 tsp cinnamon",
        "1 box vanilla instant pudding mix (6 ounce)",
        "1/2 Cup nuts (optional)",
        "1/2 Cup raisins (optional)"
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "Day One: For those making the starter from scratch: combine 1 cup milk, 1 cup sugar, and 1 cup flour in a large zip lock bag and mush to mix ingredients. For those receiving the fermented batter in a gallon zip lock bag: Do nothing. Leave it to sit on the counter."
        },
        {
            "@type": "HowToStep",
            "text": "On days 2-4: Squeeze the bag several times during the day. (If air builds up in the bag, open the zip lock slightly and remove the air). I took mine to work, laid it on my desk, and to relieve stress squeezed the bag several times during the day. Ha ha ha!"
        },
        {
            "@type": "HowToStep",
            "text": "On day 5: add 1 cup milk, 1 cup sugar, and 1 cup self-rising flour to the bag. Squeeze the bag several times during the day."
        },
        {
            "@type": "HowToStep",
            "text": "On days 6-8: Squeeze the bag several times during the day.(remove air)."
        },
        {
            "@type": "HowToStep",
            "text": "On day 9: Add 1 cup milk, 1 cup sugar, and 1 cup self-rising flour into the bag. Close zip lock. Squeeze the bag several times during the day."
        },
        {
            "@type": "HowToStep",
            "text": "Day 10: Pour 1/2 cup \"starter\" in four (4) separate gallon zip lock bags. These starters replace the milk, flour, and sugar used to start the very first batch from scratch. Give the four bags to friends along with the steps on how to finish making their own starters and bread, or freeze the starters for future use if desired, just be sure that once you take a starter out of the freezer, you let it sit out one day before starting your steps."
        },
        {
            "@type": "HowToStep",
            "text": "In a large glass bowl add 2 cups self-rising flour, 1 cup of sugar, 3 eggs, 1 cup oil, 2 tsp cinnamon, 1/2 cup milk, 1 tsp vanilla, 1 large box (or 2 small boxes) of instant vanilla pudding, 1/2 cup of either raisins, nuts, chocolate chips or fruit (optional) or 1/4 cup of any two of these ingredients; mix well."
        },
        {
            "@type": "HowToStep",
            "text": "Spray well 2 large loaf pans with cooking spray. In a small bowl or cup, mix 1 tsp cinnamon and 2 tbsp sugar. Sprinkle about 1/2 to 2/3 in loaf pans, reserving about 1/3 to 1/2 of the mix. Pour batter into pans."
        },
        {
            "@type": "HowToStep",
            "text": "Sprinkle remaining cinnamon and sugar mix across the tops of the batter. (You may choose to sprinkle the remaining mix after baking the bread)."
        },
        {
            "@type": "HowToStep",
            "text": "Bake at 325F for one hour. You may also make small loaves. If you do, bake at the same temperature, but for 25-30 minutes."
        },
        {
            "@type": "HowToStep",
            "text": "Notes: Do not use metal spoon or metal bowl for mixing. Do not refrigerate at any time during the process. Keep on the counter. If air builds up in the zip lock. Open the zipper slightly and squeeze the air out, being careful not to let any of the batter out. Quickly reseal. It is normal for the batter to thicken and bubble during the time it sits on the counter. This is called the fermentation process."
        }
    ],
    "image": [
        "/home/tim/Documents/projects/recipes/img/amish_cinnamon_bread.jpg"
    ]
}
