{
    "@context": "https://schema.org",
    "@type": "Recipe",
    "name": "Ham and cheese scones",
    "author": {
        "@type": "Person",
        "name": ""
    },
    "description": "description of recipe",
    "recipeCategory": "classic, pies",
    "recipeYield": "yield",
    "recipeIngredient": [
        "2 Cups and 3/4 all - purpose flour",
        "2 Tbsp sugar",
        "4 tsp baking powder",
        "1/4 tsp salt",
        "10 Tbsp unsalted butter, melted (1 stick plus 2 tablespoons)",
        "8 oz shredded sharp cheddar cheese, divided (2 cups)",
        "10 oz - package deli ham, chopped",
        "1/4 Cup chopped fresh chives",
        "1 Cup heavy cream",
        "1/4 Cup sour cream"
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "1. Line a baking sheet with parchment paper."
        },
        {
            "@type": "HowToStep",
            "text": "2. In a large bowl, stir together the flour, sugar, baking powder and salt. Drizzle in the melted butter, then stir well. Stir in 11/2 cups of the cheddar, the ham and chives."
        },
        {
            "@type": "HowToStep",
            "text": "3. In a small bowl, whisk together the cream and sour cream, then add to the dough and stir just until everything is moistened and the dough sticks together."
        },
        {
            "@type": "HowToStep",
            "text": "4. Turn the dough out onto a lightly floured surface. Using your hands, form the dough into a round that is 1 inch thick and 10 inches in diameter. Cut the round into 8 wedges, then transfer each to the prepared baking sheet. Freeze until ready to bake (at least 10 minutes)."
        },
        {
            "@type": "HowToStep",
            "text": "5. When ready to bake, heat the oven to 375 degrees. Ensure that the scones are evenly spaced on the baking sheet, leaving several inches between them. Sprinkle the scones with the remaining cheese. Bake for 20 to 25 minutes, or until golden and slightly firm. Cool slightly on the pan. Serve warm."
        }
    ],
    "image": [
        "/home/tim/Documents/projects/recipes/img/2280A012-EB31-40B8-AD46-F6FDD83B05F7.jpg"
    ]
}