{
    "@context": "https://schema.org",
    "@type": "Recipe",
    "name": "Nutella-Stuffed Brown Butter + Sea Salt Chocolate Chip Cookies",
    "author": {
        "@type": "Person",
        "name": ""
    },
    "description": "description of recipe",
    "recipeCategory": "classic, pies",
    "recipeYield": "yield",
    "recipeIngredient": [
        "2 1/4 Cups all - purpose flour",
        "1 1/4 tsp baking soda",
        "1/4 tsp of salt",
        "2 sticks unsalted butter (1 cup)",
        "1 1/4 Cups packed dark brown sugar",
        "1/4 Cup granulated sugar",
        "1 Large egg plus 1 egg yolk",
        "1 1/2 tsp vanilla extract",
        "1 Tbsp plain greek yogurt",
        "3/4 Cup semi - sweet chocolate chips",
        "1/2 Cup milk chocolate chips",
        "1/2 Cup dark chocolate chips",
        "1 jar of Nutella, chilled in refrigerator",
        "Coarse sea salt for sprinkling"
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "Whisk together the flour, baking soda, and salt in a bowl and set aside. Melt butter in a saucepan over medium heat. The butter will begin to foam. Make sure you whisk consistently during this process. After a couple of minutes, the butter will begin to brown on the bottom of the saucepan; continue to whisk and remove from heat as soon as the butter begins to brown and give off a nutty aroma. Immediately transfer the butter to a bowl to prevent burning. Set aside to cool for a few minutes."
        },
        {
            "@type": "HowToStep",
            "text": "With an electric mixer, mix the butter and sugars until thoroughly blended. Beat in the egg, yolk, vanilla, and yogurt until combined. Add the dry ingredients slowly and beat on low-speed just until combined. Gently fold in all of the chocolate chips."
        },
        {
            "@type": "HowToStep",
            "text": "Chill your dough for 2 hours in the refrigerator, or place in freezer for 30 minutes if you are super eager, although I cannot promise the same results if you do this."
        },
        {
            "@type": "HowToStep",
            "text": "Preheat the oven to 350 degrees F. Once dough is chilled measure about 1 1/2 tablespoons of dough and roll into a ball. Flatten the dough ball very thinly into the palm of your hand. Place 1 teaspoon of chilled nutella in the middle and fold dough around it; gently roll into a ball - it doesnt have to be perfectly rolled! Make sure that the nutella is not seeping out of the dough. Add more dough if necessary. Place dough balls on cookie sheet, 2 inches apart and flatten with your hand VERY gently. (Really only the tops need to be flattened a bit!)"
        },
        {
            "@type": "HowToStep",
            "text": "Bake the cookies 9-11 minutes or until the edges of the cookies begin to turn golden brown. They will look a bit underdone in the middle, but will continue to cook once out of the oven. Cool the cookies on the sheets at least 2 minutes. Sprinkle with a little sea salt. Remove the cooled cookies from the baking sheets after a few minutes and transfer to a wire rack to cool completely. Repeat with remaining dough."
        }
    ],
    "image": [
        "/home/tim/Documents/projects/recipes/img/35973F0A-56A0-4A47-82FA-7F4291CEF3C9.jpg"
    ]
}