{
    "@context": "https://schema.org",
    "@type": "Recipe",
    "name": "Grilled BBQ Chicken Pizza",
    "author": {
        "@type": "Person",
        "name": ""
    },
    "description": "description of recipe",
    "recipeCategory": "classic, pies",
    "recipeYield": "yield",
    "recipeIngredient": [
        "1 Small red onion",
        "2 garlic cloves, peeled",
        "2 Cups shredded cooked rotisserie chicken (500 mL)",
        "1 Cup Beer Barbecue Sauce, divided (250 mL)",
        "2 tsp finely chopped fresh oregano leaves (10 mL)",
        "1/2 tsp coarsely ground black pepper (2 mL)",
        "Cornmeal for dusting",
        "1 lb frozen prepared pizza dough, thawed (see Cook's Tip) (450 g)",
        "6 oz marbled cheddar cheese (see Cook's Tip), grated (175 g)",
        "Additional fresh oregano leaves for garnish (optional)"
    ],
    "recipeInstructions": [
        {
            "@type": "HowToStep",
            "text": "Prepare grill for indirect cooking over medium-high heat. Slice onion crosswise using Simple Slicer on #3 setting. Separate onion slices into rings. Slice garlic using Garlic Slicer. Combine chicken, 1/2 cup (125 mL) of the sauce, oregano and black pepper in Small Batter Bowl; toss to coat."
        },
        {
            "@type": "HowToStep",
            "text": "Generously sprinkle Pastry Mat with cornmeal; place dough onto center of mat. Using Baker's Roller, roll to a 12-in. (30-cm) circle. Place dough onto BBQ Pizza Pan, gently stretching to cover bottom."
        },
        {
            "@type": "HowToStep",
            "text": "Spread remaining 1/2 cup (125 mL) sauce evenly over crust to within 1/2 in. (1 cm) of edge. Top with chicken mixture, garlic and onion; sprinkle with cheese."
        },
        {
            "@type": "HowToStep",
            "text": "Place pizza pan on grid of grill. Grill, covered, 18-22 minutes or until crust is deep golden brown, carefully rotating pan occasionally using Silicone Oven Mitt. Remove pizza pan from grill. Sprinkle pizza evenly with additional oregano, if desired. Remove pizza from pan; cut pizza into 12 slices."
        },
        {
            "@type": "HowToStep",
            "text": "Nutrients per serving: (2 slices): Calories 430, Total Fat 16 g, Saturated Fat 7 g, Cholesterol 65 mg, Sodium 730 mg, Carbohydrate 50 g, Fiber 1 g, Protein 24 g"
        },
        {
            "@type": "HowToStep",
            "text": "Cook's Tips: Regular barbecue sauce can be substituted for the Beer Barbecue Sauce, if desired. "
        },
        {
            "@type": "HowToStep",
            "text": "Marbled cheddar cheese is a block of white and yellow cheddar cheeses. Cheddar and Monterey Jack cheese blend can be substituted for the marbled cheddar, if desired. "
        },
        {
            "@type": "HowToStep",
            "text": "For easier rolling, let pizza dough stand at room temperature for 20 minutes before rolling it out."
        }
    ],
    "image": [
        "/home/tim/Documents/projects/recipes/img/9EC5DBDA-BCA2-4E8F-9B47-A0B172F02355.jpg"
    ]
}